"""
Авторизоваться на сайте fix-online.sbis.ru (Демо_тензор/Демо123)
Перейти в раздел Заметок (Документы – Заметки)
Создать заметку с вашим текстом
Убедиться, что она теперь отображается
Удалить вашу заметку
"""

import atf

atf.log('Это попадет в лог')
print(atf.log.__doc__)

